cf/Catalogs/ПакетыПечатныхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ПакетыПечатныхДокументов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>стрМеста</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>180</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПечататьСразу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаКомпоновки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПечатнаяФорма</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПечатныеФормы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧислоКопий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Места</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Место</Name>
							<Type>
								<v8:Type>cfg:EnumRef.МестаВозникновенияУсловий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/CommonModules/ПечатьНаКлиенте/Ext/Module.bsl
Процедура ВыбраныНастройки(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если 	РезультатЗакрытия <> Неопределено И
			ПечатьНаСервере.СохранитьНастройкиПакетнойПечати(РезультатЗакрытия) Тогда
			
		ПоказатьОповещениеПользователя("Изменены настройки пакетной печати",,"Изменения вступят для последующих форм", БиблиотекаКартинок.Сервис);
		Для Каждого Элемент Из РезультатЗакрытия Цикл глПараметрыПакетнойПечати.Вставить(Элемент.Ключ, Элемент.Значение) КонецЦикла; КонецЕсли;
	
КонецПроцедуры
Процедура ВыбранСправочникПакет(ВыбрСправочник, ДополнительныеПараметры) Экспорт
	
	Если ВыбрСправочник <> Неопределено Тогда
		
		ДополнительныеПараметры.Параметры.Вставить("Пакет", ВыбрСправочник); 
		ОбновитьСтрокуСостоянияПакетнойПечати(ДополнительныеПараметры.ЭтаФорма.СтрокаУправленияПакетнойПечати, ДополнительныеПараметры.Параметры); КонецЕсли;
	
КонецПроцедуры
Процедура ВыборСпособаПечати(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент <> Неопределено Тогда
		
		ДополнительныеПараметры.Параметры.Вставить("СпособПечати", ВыбранныйЭлемент.Значение); 
		ОбновитьСтрокуСостоянияПакетнойПечати(ДополнительныеПараметры.ЭтаФорма.СтрокаУправленияПакетнойПечати, ДополнительныеПараметры.Параметры); КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьНавигационнуюСсылку(ЭтаФорма, ЭлементФормы, СсылкаСтроки, СтандартнаяОбработка, ФормСтрока, Параметры) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Если СсылкаСтроки = "ВыборСпособа" Тогда
		
		Соотв 	= ПечатьНаСервере.ПолучитьПредставленияСпособовПечати();
		Список 	= Новый СписокЗначений;
		Для Каждого Элемент Из Соотв Цикл Если НРег(Элемент.Значение) <> НРег("ПоУмолчанию") Тогда Список.Добавить(Элемент.Значение, Элемент.Ключ) КонецЕсли; КонецЦикла;
		
		ЭтаФорма.ПоказатьВыборИзМеню(Новый ОписаниеОповещения("ВыборСпособаПечати", ПечатьНаКлиенте, 
				Новый Структура("ЭтаФорма, Параметры",
							ЭтаФорма, Параметры)), Список, ЭлементФормы); 
		
	ИначеЕсли СсылкаСтроки = "ВыборПакета" Тогда
		
		ОткрытьФорму("Справочник.ПакетыПечатныхДокументов.ФормаВыбора",, ЭтаФорма,,,,Новый ОписаниеОповещения("ВыбранСправочникПакет", ПечатьНаКлиенте, Новый Структура("ЭтаФорма, Параметры", ЭтаФорма, Параметры)), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс); КонецЕсли;
	
КонецПроцедуры

Процедура ИницилизироватьПакетнуюПечать(ЭлементФормы, СтрокаУправленияПакетнойПечати, ПараметрыПакетнойПечати, ЭтаФорма, глПараметрыПакетнойПечати, стрМесто, ПараметрыДляЗапроса) Экспорт
	
	
	ПараметрыПакетнойПечати = глПараметрыПакетнойПечати;
	
	ПараметрыПакетнойПечати.Вставить("СпособПечати", "В никуда");
	
	//Временно не нужно
	Возврат;
	
	
	
	
	// Установим место
	ПараметрыПакетнойПечати.Вставить("Место", 				ПечатьНаСервере.ПолучитьМестоПакетнойПечатиПоСтр(стрМесто));
	ПараметрыПакетнойПечати.Вставить("ПараметрыДляЗапроса", ПараметрыДляЗапроса);
	
	// Отправим в паралельное задание для поиска нужного пакета
	ЭтаФорма.ЗапуститьПоискПакетаДляПечати();
	
	// Обновим видимость
	ОбновитьСтрокуСостоянияПакетнойПечати(СтрокаУправленияПакетнойПечати, ПараметрыПакетнойПечати);
	
КонецПроцедуры
Функция ПолучитьЦветАктивности(Параметры, ЦветАктивности)
	
	Возврат ?(Параметры.СпособПечати = "НеПечатать", WebЦвета.Серый, ?(Параметры.СпособПечати = "НаПринтер", WebЦвета.Зеленый, ЦветАктивности));
	
КонецФункции

Процедура ОбновитьСтрокуСостоянияПакетнойПечати(СтрокаСостояния, Параметры) Экспорт
	
	// Состряпаем строку
	
	Состав = Новый Массив;
	
	Если Не Параметры.Свойство("Пакет") Тогда
		Состав.Добавить(Новый ФорматированнаяСтрока("ищем пакет",,WebЦвета.Серый,,"ВыборПакета"));
		
	ИначеЕсли Не ЗначениеЗаполнено(Параметры.Пакет) Тогда
		Состав.Добавить(Новый ФорматированнаяСтрока("пакет не выбран",,ПолучитьЦветАктивности(Параметры, WebЦвета.Красный),,"ВыборПакета"));
		
	Иначе 
		Состав.Добавить(Новый ФорматированнаяСтрока(Строка(Параметры.Пакет),,ПолучитьЦветАктивности(Параметры, WebЦвета.Синий),,"ВыборПакета")); КонецЕсли;
	
	Состав.Добавить(" >> ");
	
	СпособПечати = НРег(КонвертацияТипов.ПолучитьКлючИзЗначения(ПечатьНаСервере.ПолучитьПредставленияСпособовПечати(), Параметры.СпособПечати));
	Состав.Добавить(Новый ФорматированнаяСтрока(СпособПечати,,WebЦвета.Черный,,"ВыборСпособа"));
	
	СтрокаСостояния = Новый ФорматированнаяСтрока(Состав);
	
КонецПроцедуры

Процедура НажатиеНаКартинкуПринтераВПакете(Элемент, ЭтаФорма) Экспорт
	
	ОткрытьФорму("Справочник.ПакетыПечатныхДокументов.Форма.НастройкаПакетнойПечатиПользователя",,ЭтаФорма,,,,Новый ОписаниеОповещения("ВыбраныНастройки", ПечатьНаКлиенте));
	
КонецПроцедуры

Процедура ВыполнитьПакетнуюПечать(Параметры) Экспорт
	
	ПечатьНаПринтер = Параметры.СпособПечати = "НаПринтер";
	
	// Сперва определим че делать
	
	Если 	ПечатьНаПринтер Или Параметры.СпособПечати = "ПредПросмотр" И
			ЗначениеЗаполнено(Параметры.Пакет) Тогда
			
		// а потом сделаем!
		
		Таблицы = ПечатьНаСервере.ПолучитьТабличныеДокументыДляПечати(Параметры);
		Если ПечатьНаПринтер Тогда
			ПакетПечати = Новый ПакетОтображаемыхДокументов;
			ПоказатьОповещениеПользователя("Отправляем на принтер",,Строка(Параметры.Пакет), БиблиотекаКартинок.ПечатьСразу); КонецЕсли;
		
		Для Каждого Таблица Из Таблицы Цикл
			
			Если Не Таблица.ТабличныйДокумент.ВысотаТаблицы Тогда
				ПоказатьОповещениеПользователя("Нет данных для вывода на печать",,Строка(Таблица.ПечатнаяФорма) + Символы.ПС + "печать пропущена", БиблиотекаКартинок.Олень);
				Продолжить; КонецЕсли;
			
			Если ПечатьНаПринтер Тогда // Соберем пакет для принтера
				
				АдресВХранилище = ПоместитьВоВременноеХранилище(Таблица.ТабличныйДокумент);
				
				ЭлементПакета = ПакетПечати.Состав.Добавить();
				Если Таблица.ЧислоКопий = 1 Тогда
					
					ЭлементПакета.Данные = АдресВХранилище;
					
				Иначе
					
					ВложПакет = Новый ПакетОтображаемыхДокументов;
					ВложПакет.КоличествоЭкземпляров = Таблица.ЧислоКопий;
					ЭлемВложПакета = ВложПакет.Состав.Добавить();
					ЭлемВложПакета.Данные = АдресВХранилище;
					ЭлементПакета.Данные = ВложПакет; КонецЕсли;
					
			Иначе // Выведем на экран печатные формы пусть сами решают
				
				ФункцииФормДокументов.УстановитьНастройкиТабличногоДокумента(Таблица.ТабличныйДокумент);
				Таблица.ТабличныйДокумент.Показать(Строка(Таблица.ПечатнаяФорма)); КонецЕсли;  КонецЦикла;
		
		Если ПечатьНаПринтер Тогда ПакетПечати.Напечатать(РежимИспользованияДиалогаПечати.НеИспользовать)  КонецЕсли; КонецЕсли;
	
КонецПроцедуры
